# Завдання 1: Основи HTTP
# Поясніть, що таке протокол HTTP і для чого він використовується в веб-розробці. Розкажіть про основні методи HTTP, такі як GET, POST, PUT і DELETE.
#HTTP це протокол для передачі інформації між сервером та клієнтом. Гет отримує данні. пост змінює данні. пат створює данні. делете видаляє данні
#-------------------------------------------------------------------------------
# Завдання 2: Клієнт та Сервер
# 2.1. Опишіть різницю між клієнтом і сервером у контексті веб-розробки.
# Клієнтзадає запит на сервер де його обробляють та надсилають відповідь на запит.
# 2.2. Поясніть, як клієнт та сервер взаємодіють за допомогою HTTP-запитів та відповідей.
# Взаємодіють за допомогою різних методів таких як get post put delete
#-------------------------------------------------------------------------------


import requests
site = "https://jsonplaceholder.typicode.com/posts"
#Блок бібліотеки requests:
# Завдання 1: Виконання GET-запиту
# Створіть Python-сценарій, який використовує бібліотеку requests для виконання GET-запиту до веб-ресурсу та виведення вмісту веб-сторінки на екран. Використовуйте
# функцію requests.get() для виконання запиту.
# reqest_get =  requests.get(url = site)
# print(reqest_get.status_code)
# print(reqest_get.reason)
# print(reqest_get.text)
#-------------------------------------------------------------------------------
# Завдання 2: Параметри запиту
# Розширте попереднє завдання, додаючи можливість вказати параметри запиту. Виконайте GET-запит до веб-ресурсу, передаючи параметри запиту, такі як параметри запиту у
# URL або параметри через словник.
params = {
    "userId": 10,
    "id": 100
}
reqest_get =  requests.get(url = site + "/1", params = params)
print(reqest_get.status_code)
print(reqest_get.reason)
print(reqest_get.text)
print("-------------------------------------------------------------------------------")
# Завдання 3: POST-запит
# Створіть Python-сценарій для виконання POST-запиту до веб-ресурсу. Відправте дані на сервер, наприклад, форму з ім'ям користувача і паролем.
stanislav = {
    "userId": 10,
    "id": 101,
    "name": "Stanislav",
    "password": "11111111"
}
reqest_post = requests.post(url = site, data = stanislav)
print(reqest_post.status_code)
print(reqest_post.reason)
print(reqest_post.text)
print("-------------------------------------------------------------------------------")
# Завдання 4: Обробка відповіді
# Після виконання запиту, розпарсьте вміст HTTP-відповіді та виведіть потрібну інформацію. Наприклад, виведіть заголовки відповіді або вміст сторінки.
first_user = reqest_get.json()
print(first_user["body"])
print("-------------------------------------------------------------------------------")
try:
    try_get = requests.get(url = site, timeout=0.001)

    print("успіх")
    print(try_get.status_code)
except requests.exceptions.ConnectionError as e:
    print("помилка")
    print(e)
    print("живем далі")

# Завдання 6: Збереження вмісту в файл
# Розширте ваш код, щоб зберегти отриманий вміст веб-сторінки у файл. Використайте функціонал Python для роботи з файлами для збереження вмісту.
with open("data.txt", "w") as file:
    for index, item in first_user.items():
        file.write(index + ", " + str(item) + "\n")


